<?php

return [
    'plural' => 'المقالات',
    'singular' => 'المقالة',
    'empty' => 'لا توجد مقالات',
    'select' => 'اختر المقالة',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'plural' => 'الإجراءات',
        'list' => 'كل المقالات',
        'show' => 'عرض',
        'create' => 'إضافة مقالة جديده',
        'new' => 'إضافة',
        'edit' => 'تعديل المقالة',
        'delete' => 'حذف المقالة',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة المقالة بنجاح',
        'updated' => 'تم تعديل المقالة بنجاح',
        'deleted' => 'تم حذف المقالة بنجاح',
        'retrieved' => 'تم أسترجاع بيانات المقالة بنجاح',
        'dimensions' => '* يجب أن تكون أبعاد الصورة :dimensions بكسل',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'عنوان المقال',
        'description' => 'تفاصيل المقال',
        'image' => 'الصورة',
        'status' => 'الحالة',
        'created_at' => 'تاريخ الإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه المقالة ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
