<?php

return [
    'plural' => 'العلامات التجارية',
    'singular' => 'العلامة التجارية',
    'empty' => 'لا توجد علامات تجارية',
    'select' => 'اختر العلامة التجارية',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'الإجراءات',
        'list' => 'كل العلامات التجارية',
        'show' => 'عرض',
        'create' => 'إضافة علامة تجارية جديده',
        'new' => 'إضافة',
        'edit' => 'تعديل العلامة التجارية',
        'delete' => 'حذف العلامة التجارية',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة العلامة التجارية بنجاح',
        'updated' => 'تم تعديل العلامة التجارية بنجاح',
        'deleted' => 'تم حذف العلامة التجارية بنجاح',
        'retrieved' => 'تم أسترجاع بيانات العلامة التجارية بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'الاسم',
        'description' => 'الوصف',
        'image' => 'الصورة',
        'status' => 'الحالة',
        'created_at' => 'تاريخ الإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه العلامة التجارية ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
