<?php

return [
    'plural' => 'أقسام المنتجات',
    'singular' => 'قسم المنتجات',
    'empty' => 'لا توجد أقسام للمنتجات',
    'select' => 'اختر قسم المنتجات',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'الإجراءات',
        'list' => 'كل أقسام المنتجات',
        'show' => 'عرض',
        'create' => 'إضافة قسم جديد',
        'new' => 'إضافة',
        'edit' => 'تعديل قسم المنتجات',
        'delete' => 'حذف قسم المنتجات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة قسم المنتجات بنجاح',
        'updated' => 'تم تعديل قسم المنتجات بنجاح',
        'deleted' => 'تم حذف قسم المنتجات بنجاح',
        'retrieved' => 'تم أسترجاع بيانات قسم المنتجات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'الاسم',
        'description' => 'الوصف',
        'image' => 'الصورة',
        'type' => 'النوع',
        'parent_id' => 'القسم رئيسي',
        'status' => 'الحالة',
        'created_at' => 'تاريخ الإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه قسم المنتجات ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'type' => [
        'SUB_CATEGORY' => 'قسم فرعي',
        'MAIN_CATEGORY' => 'قسم رئيسي',
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
