<?php

return [
    'plural' => 'مجموعات المنتجات',
    'singular' => 'مجموعة المنتجات',
    'empty' => 'لا توجد أقسام للمنتجات',
    'select' => 'اختر مجموعة المنتجات',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'plural' => 'الإجراءات',
        'list' => 'كل مجموعات المنتجات',
        'show' => 'عرض',
        'create' => 'إضافة مجموعة جديده',
        'new' => 'إضافة',
        'edit' => 'تعديل مجموعة المنتجات',
        'delete' => 'حذف مجموعة المنتجات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة مجموعة المنتجات بنجاح',
        'updated' => 'تم تعديل مجموعة المنتجات بنجاح',
        'deleted' => 'تم حذف مجموعة المنتجات بنجاح',
        'retrieved' => 'تم أسترجاع بيانات مجموعة المنتجات بنجاح',
        'dimensions' => '* يجب أن تكون أبعاد الصورة :dimensions بكسل',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'الاسم',
        'description' => 'الوصف',
        'products_ids' => 'المنتجات',
        'image' => 'الصورة',
        'status' => 'الحالة',
        'created_at' => 'تاريخ الإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه مجموعة المنتجات ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
