<?php

return [
    'plural' => 'الخدمات',
    'singular' => 'الخدمة',
    'empty' => 'لا توجد خدمات',
    'select' => 'اختر الخدمة',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'الإجراءات',
        'list' => 'كل الخدمات',
        'show' => 'عرض',
        'create' => 'إضافة خدمة جديدة',
        'new' => 'إضافة',
        'edit' => 'تعديل الخدمة',
        'delete' => 'حذف الخدمة',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة الخدمة بنجاح',
        'updated' => 'تم تعديل الخدمة بنجاح',
        'deleted' => 'تم حذف الخدمة بنجاح',
        'retrieved' => 'تم أسترجاع بيانات الخدمة بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'الاسم',
        'description' => 'الوصف',
        'icon' => 'الايكونة',
        'status' => 'الحالة',
        'created_at' => 'تاريخ الإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه الخدمة ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
