<?php

return [
    'plural' => 'الوسوم',
    'singular' => 'الوسم',
    'empty' => 'لا توجد وسوم',
    'select' => 'اختر الوسم',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'الإجراءات',
        'list' => 'كل الوسوم',
        'show' => 'عرض',
        'create' => 'إضافة علامة تجارية جديده',
        'new' => 'إضافة',
        'edit' => 'تعديل الوسم',
        'delete' => 'حذف الوسم',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة الوسم بنجاح',
        'updated' => 'تم تعديل الوسم بنجاح',
        'deleted' => 'تم حذف الوسم بنجاح',
        'retrieved' => 'تم أسترجاع بيانات الوسم بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title_ar' => 'اسم الوسم (بالعربية)',
        'title_en' => 'اسم الوسم (بالإنجليزية)',
        'status' => 'الحالة',
        'created_at' => 'تاريخ الإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه الوسم ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
